[
  {
    "id": "six_aspects_overview",
    "title": "The Six Aspects and Their Properties",
    "content": "In this universe there are six known cosmic forces from which all things are derived. These forces are known as the Aspects, the immeasurable powers that have no beginning and no end. It is not possible to destroy an element by any means known to mortals, though it has been theorized that if an element were to be removed in its entirety, the foundation of the universe would collapse into an unrectifiable Chaos. Even the slightest imbalance of Aspects furthers the influence of Chaos in the observable universe; a complete removal of one of the six basic Aspects would assure final destruction of all matter with no possible chance of recovery.\n\nKey Assumptions:\n- Water and Fire are considered direct opposites and are thus placed parallel to one another on the Elemental Cube\n- Earth and Air are considered direct opposites and are thus placed parallel to one another on the Elemental Cube\n- Light and Dark are considered direct opposites and are thus placed parallel to one another on the Elemental Cube",
    "category": "lore",
    "tags": ["aspects", "cosmic", "forces", "elements", "cube"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "elemental_cube_faces",
    "title": "Elemental Cube - The Six Faces",
    "content": "List of Faces and some of their known properties:\n- Fire (Front Face) - Anger, Passion, Wrath\n- Water (Back Face) - Serenity, Healing, Patience\n- Earth (Left Face) - Strength, Hardiness, Protection\n- Air (Right Face) - Swiftness, Focus, Communication\n- Light (Top Face) - Vision, Clarity, Godliness\n- Dark (Bottom Face) - Obfuscation, Dreams, Nothingness",
    "category": "lore",
    "tags": ["aspects", "faces", "properties", "elements"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "elemental_cube_edges",
    "title": "Elemental Cube - The Twelve Edges",
    "content": "List of Edges and example properties:\n- Explosion (Fire & Light) - Warmth\n- Magma (Fire & Earth) - Power\n- Implosion (Fire & Dark) - Ambition\n- Heat (Fire & Air) - Scorn\n- Mirage (Water & Light) - Illusion\n- Clay (Water & Earth) - Malleability\n- Obfuscation (Water & Dark) - Subconsciousness\n- Storm (Water & Air) - Replenishment\n- Mountains (Earth & Light) - Visible Strength\n- Caves (Earth & Dark) - Unseen Strength\n- Exhalation (Air & Light) - Blessings\n- Inhalation (Air & Dark) - Curses",
    "category": "lore",
    "tags": ["aspects", "edges", "combinations", "properties"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "elemental_cube_vertices",
    "title": "Elemental Cube - The Eight Vertices",
    "content": "List of Vertices and properties:\n- (Light, Earth, Water) - Growth\n- (Light, Air, Water) - Cleansing Rain\n- (Light, Earth, Fire) - Eruption\n- (Light, Fire, Air) - Righteousness\n- (Dark, Fire, Earth) - Unrest\n- (Dark, Fire, Air) - Wickedness\n- (Dark, Earth, Water) - Decay\n- (Dark, Air, Water) - Hurricane",
    "category": "lore",
    "tags": ["aspects", "vertices", "combinations", "properties"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "gods_and_champions",
    "title": "The Six Aspects, the Gods, and Their Champions",
    "content": "The gods draw their power from the six aspects. No one knows if the Aspects created the Gods or the Gods created the Aspects. Within each Aspect, there are multiple Gods, but one of those Gods always directly represents the Aspect, and that \"Prime God\" holds power over the other Gods in that Aspect. Each God has a title that communicates their temperament and domain. Corresponding with each God is a Champion. In the current epoch of history, these Champions are mostly dead, or at least presumed dead. The living Champions are very elderly. Some of the classes available to players were founded by one of these Champions.",
    "category": "lore",
    "tags": ["gods", "champions", "aspects", "pantheon"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "fire_aspect_gods",
    "title": "Fire Aspect - Gods and Champions",
    "content": "Fire Aspect Gods:\n- Rajdo the Undying (Prime God) - Champion: Leon Truestep\n- Rytren the Dessicator - Champion: Teresa Flatlander\n- Ballast the Wheel - Champion: Fenton van Haasen\n\nRajdo lives in every flame across all of Adrullan, from the barest flickering candle to the mightiest conflagration. Her followers practice passionate expression and renewal through sacred destruction.\n\nRytren bakes and burns Adrullan with his mighty rays. His followers believe that Rytren provides for the deprived, coating themselves in dust from head to toe and traveling with the sun.\n\nBallast grinds, melts, and beats the natural world of Adrullan into machinery, architecture, and wealth. His followers believe that the profit motive is the highest form of morality.",
    "category": "lore",
    "tags": ["fire", "gods", "champions", "rajdo", "rytren", "ballast"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "earth_aspect_gods",
    "title": "Earth Aspect - Gods and Champions",
    "content": "Earth Aspect Gods:\n- Yanus the Mantle (Prime God)\n- Fenla the Wild\n- Tibolt the Warden\n\nYanus inhabits all entities of the earth, from the smallest grain of sand to the largest mountain peak. His followers worship the earth and all the bounty it provides, believing the land to be the beginning and the end of all life.\n\nFenla is the goddess of all the lands of Adrullan not tamed by the civilized races. The flora and fauna of the world is said to have been created from her blood.\n\nTibolt presides over the ever-turning wheel of time in Adrullan, governing the forces that shape the natural world through the seasonal cycle.",
    "category": "lore",
    "tags": ["earth", "gods", "yanus", "fenla", "tibolt"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "air_aspect_gods",
    "title": "Air Aspect - Gods and Champions",
    "content": "Air Aspect Gods:\n- Sumuliss the Wind (Prime God)\n- Chitteryx the Swarm\n- Anatma the Unwanting\n\nSumuliss rides the winds that gust and dance across the face of Adrullan. Her followers are the fleet-footed messengers, the far-traveling explorers, and the cunning riders of the gale.\n\nChitteryx manifests as a writhing mass of chitinous bodies. Devotees of the Swarm embrace the power of the collective, working tirelessly like ants in a colony.\n\nAnatma embodies the serenity of a life free from desire. Her followers strive to release themselves from the shackles of want and need, finding contentment in simplicity and tranquility.",
    "category": "lore",
    "tags": ["air", "gods", "sumuliss", "chitteryx", "anatma"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "water_aspect_gods",
    "title": "Water Aspect - Gods and Champions",
    "content": "Water Aspect Gods:\n- Vexx the Flood (Prime God)\n- Celtrious the Tide\n- Mortas the Decomposed\n\nVexx is as changeable as the tides and as powerful as a tsunami. Those who worship the Flood respect the life-giving nature of water, but also fear its potential for destruction.\n\nCeltrious governs the moon and the tides, exerting a subtle but profound influence on the world. Followers believe in the cyclical nature of all things.\n\nMortas presides over the necessary decay that fuels new growth. Devotees understand that death and decay are integral parts of the cycle of life.",
    "category": "lore",
    "tags": ["water", "gods", "vexx", "celtrious", "mortas"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "light_aspect_gods",
    "title": "Light Aspect - Gods and Champions",
    "content": "Light Aspect Gods:\n- Hadrius the Blinding (Prime God) - Champion: Nimrion\n- Alder the Scale\n- Philos the Ardent\n- Ayda the Dawn\n- Senan the Illuminator\n\nHadrius shines with an intensity that both illuminates and obscures. Followers seek truth and enlightenment, but understand that too much illumination can be searing.\n\nAlder's immutable gaze falls upon all of Adrullan, weighing the souls of the living and the dead. His followers are the arbiters and adjudicators.\n\nPhilos burns with a passion that can warm the coldest heart. Followers embrace love in all its forms.\n\nAyda rises each morning with the promise of a new day. Devotees find in Ayda a constant reminder that no night is eternal.\n\nSenan represents knowledge and illumination, guiding seekers of wisdom and understanding.",
    "category": "lore",
    "tags": ["light", "gods", "hadrius", "alder", "philos", "ayda", "senan"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "dark_aspect_gods",
    "title": "Dark Aspect - Gods and Champions",
    "content": "Dark Aspect Gods:\n- Oberos the Eclipse (Prime God)\n- Thornwise the Dissembler\n- Godrix the Despised\n- Grixius the Whisper - Champion: Ereshki\n- Zegrath the Barbarian\n- Zarina the Kiss of Death\n\nOberos holds sway over the shadows that creep and the night that falls. Followers understand the fear of darkness and harness the shadows' primal influence.\n\nThornwise weaves a web of lies and misdirection. Devotees understand that truth is a malleable thing.\n\nGodrix simmers with an eternal, seething rage. Followers understand the power of hatred and how it can be honed into a weapon.\n\nGrixius is the voice in the back of your mind that warns of danger. Devotees understand that fear is a survival mechanism.\n\nZegrath revels in the chaos of the battlefield. Followers embrace the thrill of combat and find glory in the clash of arms.\n\nZarina is the final whisper that all mortals hear in the end. Devotees understand that death is the great equalizer.",
    "category": "lore",
    "tags": ["dark", "gods", "oberos", "thornwise", "godrix", "grixius", "zegrath", "zarina"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "central_conflict",
    "title": "Central Conflict - The Age of Heroism Ends",
    "content": "The gods, in their view, have left the world in the hands of their earthly stewards. At the close of the Age of Heroism - a time of divine magic and high adventure - the class orders have been established and tasked with guarding the realm and maintaining order as the gods recede and move on to other divine business. As the Gods left, they imprisoned the magic and power of the Six Aspects into six Divine Artifacts, each of which was hidden deep in its attendant realm.\n\nNot long after the Gods departed, the nations of the realm of Light began to observe a change in their surroundings. Color faded and then drained from the land, and over time the realm of Light slowly transformed into a gray and ashen waste. There are rumors that a heretical wizard named Ludos has found a way to seize the Divine Artifact of Light, undoing creation, unleashing chaos magic, and drawing the ire of the Gods in Exile. His plan is to split the Divine Artifact of Light to create a 7th Aspect, achieving godhood through a new Chaos Aspect. If successful, he will be the God of Chaos, the 7th Aspect: Ludos the Unbound.\n\nAs the grim news spreads from the Realm of Light, the Orders of the Champions and the Class Orders have observed that their divine powers are slowly returning. Some even believe they are being anointed and charged with reclaiming the Artifact of Light and returning balance to the six aspects.",
    "category": "lore",
    "tags": ["conflict", "gods", "artifacts", "ludos", "chaos", "age_of_heroism"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "cult_of_unbound",
    "title": "The Cult of the Unbound",
    "content": "There are rumors of a Cult of the Unbound who resent the Pantheon of the Six Aspects for, in their view, abandoning the world. Word of this cult is trickling in from the wild and unclaimed places of Adrullan, and terrified adventurers have reported that beings both mortal and monstrous call the Cult their home. In stricken whispers over mugs of ale going warm and flat, they say that the Cult serves none but itself, and believes a new divine order will be established, with their new God holding supremacy over all creation.",
    "category": "lore",
    "tags": ["cult", "unbound", "ludos", "heresy", "factions"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "leon_truestep_champion",
    "title": "Leon Truestep - Champion of Rajdo the Undying",
    "content": "Leon was a dancing fire-eater in a wicked city. Every day he danced and breathed tremendous plumes of fire on the sad corner of the dirty street where he made his shoddy home, singing songs of celebration and triumph. Despite the derision and pity from passersby, Leon knew his path was true and dignified.\n\nOne day, after being robbed and left for dead, Leon had a vision of a tiny flame that spoke to him as Rajdo. When he awoke, he discovered he had been chosen. The next day, as he performed his new song 'The Song of Rajdo,' a tongue of flame appeared on his brow and he unleashed a roaring column of fire that consumed the entire wicked city.\n\nRajdo spoke to him: 'Lord of Bards! Dance your way through Adrullan. Teach my song to those who will learn. Raise your voices as one!' Leon became the founder of the Bard class and continues to dance and sing across Adrullan, spreading Rajdo's fire and music.",
    "category": "lore",
    "tags": ["champion", "leon_truestep", "rajdo", "bard", "fire"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "teresa_flatlander_champion",
    "title": "Teresa Flatlander - Champion of Rytren the Dessicator",
    "content": "Banished from her caravan for a theft she didn't commit, Teresa had been walking through the desert for days, perhaps weeks. Her canteen was empty and she was gripped by thirst. As she walked along, she encountered a desert fox covered in dust. The fox spoke to her and told her to stay, then disappeared after covering her in dust that quenched her thirst.\n\nTeresa stayed and meditated in that place for years, growing powerful with wisdom. Travelers would offer her passage to safety, but she always refused, baptizing herself in sand. Soon, word spread of the woman in the desert who took no drink or food, and seekers traveled to see her, discovering that so long as they sat with Teresa, they too were free of thirst and hunger.\n\nAfter four years of meditation, the fox reappeared and revealed itself as Rytren. Teresa followed the fox westward, leading her congregation on what became known as the Circuit of the Sun, founding the Wandering Order of the Parched.",
    "category": "lore",
    "tags": ["champion", "teresa_flatlander", "rytren", "sun", "desert"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "fenton_van_haasen_champion",
    "title": "Fenton van Haasen - Champion of Ballast the Wheel",
    "content": "Fenton van Haasen was a gnome who ran Van Haasen Enterprises, a mining operation that offered high wages and adequate lodging. He had unique management practices, providing each worker with their own autonomous mineshaft for which they bore sole responsibility and from which they exclusively reaped the benefits of their labors.\n\nWorkers were given a candle to mark their shift - when it extinguished, their shift would be over. However, these candles burned indefinitely, and workers would toil for years without realizing the passage of time, thinking only of the fine clothes and rich foods they would buy with their wages.\n\nFenton's philosophy was that greater productivity could be realized when workers were empowered to be the sovereign stewards of their own individuated domains, free from distraction by perspectives which may or may not be complementary with those of Van Haasen management. He became the embodiment of Ballast's industrial philosophy.",
    "category": "lore",
    "tags": ["champion", "fenton_van_haasen", "ballast", "industry", "mining"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "classes_and_founders",
    "title": "Classes and Their Founders",
    "content": "Class - Founder - Deity Association(s):\n- Bard - Leon Truestep - Industry, Deceit, Light, Air, Love, War\n- Cleric - (No specific founder) - Light, Justice, Love, Hope\n- Druid - (No specific founder) - Sun, Earth, Nature, Seasons, Insects, Moon, Rot\n- Enchanter - (No specific founder) - Air, Moon, Peace, Light, Deceit, Fear\n- Magician - (No specific founder) - Fire, Earth, Air, Water, Light, Dark\n- Monk - (No specific founder) - Fire, Air, Peace, Moon, War\n- Necromancer - (No specific founder) - Sun, Insects, Rot, Dark, Deceit, Hate, Fear, Death\n- Paladin - (No specific founder) - Fire, Industry, Light, Justice, Hope, War\n- Ranger - (No specific founder) - Fire, Industry, Earth, Nature, Seasons, War\n- Rogue - (No specific founder) - Industry, Dark, Deceit, War, Death\n- Shadowknight - (No specific founder) - Industry, Insects, Rot, Justice, Dark, Hate, War, Death\n- Shaman - (No specific founder) - Fire, Earth, Nature, Seasons, Air, Insects, Water, Moon, Rot\n- Warrior - (No specific founder) - Industry, Justice, War, Death\n- Wizard - (No specific founder) - Fire, Earth, Air, Water, Light, Dark",
    "category": "lore",
    "tags": ["classes", "founders", "deities", "associations"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "races_and_classes",
    "title": "Races and Their Available Classes",
    "content": "Race - Available Classes - Deity Associations:\n- Humans - All classes - All deity associations\n- Barbarians - Rogue, Shaman, Warrior - Dark, Deceit, Fire, Earth, Nature, Seasons, Air, Insects, Water, Moon, Rot, Industry, Justice, War, Death\n- Dark Elves - Cleric, Enchanter, Magician, Necromancer, Rogue, Shadowknight, Warrior, Wizard - Light, Justice, Love, Hope, Air, Moon, Peace, Deceit, Fear, Fire, Earth, Water, Dark, Sun, Insects, Rot, Hate, Death, Industry, War\n- Halflings - Cleric, Druid, Rogue, Warrior - Light, Justice, Love, Hope, Sun, Earth, Nature, Seasons, Insects, Moon, Rot, Industry, Dark, Deceit, War, Death\n- High Elves - Cleric, Enchanter, Magician, Paladin, Wizard - Light, Justice, Love, Hope, Air, Moon, Peace, Deceit, Fear, Fire, Earth, Water, Dark, Industry, War\n- Wood Elves - Bard, Druid, Ranger, Rogue, Warrior - Industry, Deceit, Light, Air, Love, War, Sun, Earth, Nature, Seasons, Insects, Moon, Rot, Dark, Death, Justice\n- Djinn - Cleric, Enchanter, Magician, Necromancer, Paladin, Shadowknight, Rogue - All deity associations\n- Dwarves - Cleric, Paladin, Rogue, Warrior - Light, Justice, Love, Hope, Fire, Industry, War, Dark, Deceit, Death\n- Half Elves - Bard, Druid, Paladin, Ranger, Rogue, Warrior - Industry, Deceit, Light, Air, Love, War, Sun, Earth, Nature, Seasons, Insects, Moon, Rot, Fire, Justice, Hope, Dark, Death\n- Ogres - Shadowknight, Shaman, Warrior, Monk - Industry, Insects, Rot, Justice, Dark, Hate, War, Death, Fire, Earth, Nature, Seasons, Air, Water, Moon\n- Trolls - Shadowknight, Shaman, Warrior - Industry, Insects, Rot, Justice, Dark, Hate, War, Death, Fire, Earth, Nature, Seasons, Air, Water, Moon\n- Gnomes - Cleric, Enchanter, Magician, Necromancer, Rogue, Warrior, Wizard - All deity associations",
    "category": "lore",
    "tags": ["races", "classes", "deities", "associations"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  },
  {
    "id": "timeline_reference",
    "title": "Timeline of Adrullan History",
    "content": "Chronicle of all Global and Local Events (Enter Year, Topic, Event). Keep sorted by year.\nReference: https://docs.google.com/spreadsheets/d/19DGGY5Pm8C8DVsbK2b7VUJcQ4cMWnG7JjlJCpWl5Clo/edit?gid=0#gid=0\n\nThis timeline tracks the major events in Adrullan's history, from the Age of Heroism through the current crisis with Ludos and the Cult of the Unbound.",
    "category": "lore",
    "tags": ["timeline", "history", "events", "chronology"],
    "source_url": "design_docs",
    "last_updated": "2025-01-15",
    "priority": "high"
  }
]
